In [15]:
import pandas as pd

In [16]:
df = pd.read_csv('data_ptajbs.csv')
df

   NO      NAMA  USIA      KOTA        GAJI
0   1     Yuyun  36.0         -   6500000.0
1   2  Veronika   NaN  Wonogiri   4500000.0
2   3         -  46.0   Nganjuk         NaN
3   4      Ecky  32.0   Bau-Bau   6500000.0
4   5      Aziz  27.0    Madura   5000000.0
5   6      Tono  55.0       n.a  10000000.0

In [17]:
df.isnull()

      NO   NAMA   USIA   KOTA   GAJI
0  False  False  False  False  False
1  False  False   True  False  False
2  False  False  False  False   True
3  False  False  False  False  False
4  False  False  False  False  False
5  False  False  False  False  False

In [21]:
dfre = pd.read_csv('data_ptajbs.csv',
                  na_values = ['-','n.a'])
dfre = dfre.fillna(
        {'NAMA': 'Hamba Allah',
         'GAJI': '3700000'}
        )
#forward filling
# dfre = dfre.fillna(method = 'ffill', axis=0)
#backward filling
# dfre = dfre.fillna(method = 'bfill', axis=0)
#interpolate
#dfre = dfre.interpolate
#hapus data nan
dfre = dfre.dropna()
dfre

   NO         NAMA  USIA      KOTA     GAJI
0   1        Yuyun  36.0       NaN  6.5e+06
1   2     Veronika   NaN  Wonogiri  4.5e+06
2   3  Hamba Allah  46.0   Nganjuk  3700000
3   4         Ecky  32.0   Bau-Bau  6.5e+06
4   5         Aziz  27.0    Madura    5e+06
5   6         Tono  55.0       NaN    1e+07

In [19]:
dfre.isnull()

      NO   NAMA   USIA   KOTA   GAJI
0  False  False  False   True  False
1  False  False   True  False  False
2  False  False  False  False  False
3  False  False  False  False  False
4  False  False  False  False  False
5  False  False  False   True  False

In [22]:
dfre['GAJI'].dtypes

dtype('O')

In [29]:
dfre['GAJI'] = dfre['GAJI'].astype(int)

dtype('int32')

In [27]:
dfre['GAJI'].dtypes

dtype('int32')

In [28]:
dfre

   NO         NAMA  USIA      KOTA      GAJI
0   1        Yuyun  36.0       NaN   6500000
1   2     Veronika   NaN  Wonogiri   4500000
2   3  Hamba Allah  46.0   Nganjuk   3700000
3   4         Ecky  32.0   Bau-Bau   6500000
4   5         Aziz  27.0    Madura   5000000
5   6         Tono  55.0       NaN  10000000

In [30]:
dfre['NAMA'].dtypes

dtype('O')

In [31]:
dfre['NAMA'] = dfre['NAMA'].astype(str)

In [32]:
dfre['NAMA'].dtypes

dtype('O')

In [37]:
#Threshold data
dfre = dfre.dropna(thresh = 5)
dfre
# dfre = dfre.dropna(subset = ['nama','usia'])

   NO         NAMA  USIA     KOTA     GAJI
2   3  Hamba Allah  46.0  Nganjuk  3700000
3   4         Ecky  32.0  Bau-Bau  6500000
4   5         Aziz  27.0   Madura  5000000